In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.10.12.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.19.0-50-generic
Version          : #50-Ubuntu SMP PREEMPT_DYNAMIC Mon Jul 10 18:24:29 UTC 2023
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_IN
LOCALE           : en_IN.ISO8859-1

pandas           : 1.5.3
numpy            : 1.25.1
pytz             : 2022.1
dateutil         : 2.8.2
setuptools       : None
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.9.0
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.2
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.11.1
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

In [4]:
data={'animal':['cat', 'cat', 'snake','dog','dog','cat','snake','cat','dog','dog'],
     'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
      'visits':[1,3,2,3,2,3,1,1,2,1],
      'priority':['yes','yes','no','yes','no','no','no','yes','no','no']
     }
labels=['a','b','c','d','e','f','g','h','i','j']
df=pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [6]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [7]:
df.iloc[:3] # row  / for column [:,start: stop] or fancy indexing
# or equivalently
df.iloc[:,[1,3]]# fancy indexing
# or
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [8]:
# print animal age 
df.loc[:,['animal','age']] # loc[] for key  / iloc[] for index
# or 
df[['animal','age']]
# for column 
df['visits'] # for than one key pass list as index [['animal','age']]

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: visits, dtype: int64

In [9]:
df.loc[df.index[[3,4,8]],['animal','age']] # specific row and column loc[row,column]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [10]:
df[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [11]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [12]:
df[(df['animal']=='cat') & (df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [13]:
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [14]:
df.loc['f','age']=1.5

In [15]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [16]:
df['visits'].sum()

19

In [17]:
df.groupby('animal')['age'].sum()

animal
cat       7.0
dog      15.0
snake     5.0
Name: age, dtype: float64

In [18]:
df.loc['k']=['dog',5.5,2,'no'] # new row
df.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [19]:
df.drop('k')
df['animal'].count() # it counts all

11

In [20]:
df['animal'].value_counts() # it count each elements repeatation

dog      5
cat      4
snake    2
Name: animal, dtype: int64

In [21]:
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
k    dog  5.5       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [22]:
df['priority']=df['priority'].map({'yes':True,'no':False})
df.rename(columns={'visits':'birth'},inplace=True) # to change column name

In [23]:
df['animal']=df['animal'].replace('snake','python')
df

   animal  age  birth  priority
a     cat  2.5      1      True
b     cat  3.0      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog  5.0      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog  7.0      2     False
j     dog  3.0      1     False
k     dog  5.5      2     False

In [24]:
df.pivot_table(index='animal',columns='birth',values='age',aggfunc='mean')

birth     1         2     3
animal
cat     2.5       NaN  2.25
dog     3.0  5.833333   NaN
python  4.5  0.500000   NaN

# Slightly trickier

In [25]:
daf=pd.DataFrame({'A':[1,2,2,3,4,5,5,6,7,7]})

In [26]:
daf

   A
0  1
1  2
2  2
3  3
4  4
5  5
6  5
7  6
8  7
9  7

In [27]:
daf['A'].shift()!=daf['A'] # check duplicate element

0     True
1     True
2    False
3     True
4     True
5     True
6    False
7     True
8     True
9    False
Name: A, dtype: bool

In [28]:
daf.loc[daf['A'].shift()!=daf['A']] 
# or 
daf.drop_duplicates(subset='A')

   A
0  1
1  2
3  3
4  4
5  5
7  6
8  7

In [29]:
newdf=pd.DataFrame(np.random.random((5,3)),columns=['a','b','c'])
newdf.sub(newdf.mean(axis=1),axis=0)# axis 0 column and axis 1 row

          a         b         c
0  0.253619 -0.118313 -0.135306
1  0.189417  0.095764 -0.285180
2 -0.072853 -0.204063  0.276916
3  0.295978 -0.408715  0.112737
4 -0.307523  0.334226 -0.026703

In [30]:
df1=pd.DataFrame(np.random.random((5,10)),columns=list('abcdefghij'))
df1.sum().idxmin() # return which column has smallet sum

'g'

In [31]:
df2=pd.DataFrame(np.random.randint(0,2,(10,3)))
print(len(df2)-df2.duplicated(keep=False).sum())
# alternative more simply....
df2.drop_duplicates(keep=False)

3

   0  1  2
1  1  0  1
3  1  0  0
6  0  0  1

In [32]:
nan=np.nan
data1=[[0.04,nan,nan,0.25,nan,0.43,0.71,0.51,nan,nan],
       [nan,nan,nan,0.04,0.76,nan,nan,0.67,0.76,0.16],
       [nan,nan,0.50,nan,0.31,0.4,nan,nan,0.24,0.01],
       [0.49,nan,nan,0.62,0.73,0.26,0.85,nan,nan,nan],
       [nan,nan,0.41,nan,0.05,nan,0.61,nan,0.48,0.68]
      ]

col=list('abcdefghij')
df3=pd.DataFrame(data1,columns=col)
(df3.isnull().cumsum(axis=1)==3).idxmax(axis=1)

0    e
1    c
2    d
3    h
4    d
dtype: object

In [33]:
df4=pd.DataFrame({'grps':list('aaabbcaabcccbbc'),
               'vals':[12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

d=df4.groupby('grps')['vals'].nlargest(3)
d.unstack().sum(axis=1).astype('int')

grps
a    409
b    156
c    345
dtype: int64

In [34]:
print(d)
d.unstack(level=-1) # level changes column  to index (-1 : default)

grps
a     1     345
      7      52
      0      12
b     12     57
      8      54
      4      45
c     10    235
      14     87
      9      23
Name: vals, dtype: int64

        0      1     4     7     8     9      10    12    14
grps
a     12.0  345.0   NaN  52.0   NaN   NaN    NaN   NaN   NaN
b      NaN    NaN  45.0   NaN  54.0   NaN    NaN  57.0   NaN
c      NaN    NaN   NaN   NaN   NaN  23.0  235.0   NaN  87.0

In [35]:
df5=pd.DataFrame(np.random.RandomState(8765).randint(0,101,(10,2)),columns=['A','B'])
df5.groupby(pd.cut(df5['A'],np.arange(0,101,10)))['B'].sum()

A
(0, 10]      53
(10, 20]      0
(20, 30]     82
(30, 40]     51
(40, 50]     90
(50, 60]      0
(60, 70]     92
(70, 80]     21
(80, 90]      0
(90, 100]     0
Name: B, dtype: int64

In [36]:
df6=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})
izero=np.r_[-1,np.where(df6==0)[0]]
idx=np.arange(len(df6))
Y=df6['X']!=0
df6['Y']=idx-izero[np.searchsorted(izero-1,idx)-1]
df6

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [37]:
np.searchsorted([1,2,3,4,5],6) # np.searchsorted(givenarr,data) return at index to place given data/array in given array

5

In [38]:
# alternative
df7=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})
x=(df7['X']!=0).cumsum() # return cumulative sum of 1/0 i.e True / False
y=x!=x.shift()
df7['Y']=y.groupby((y!=y.shift()).cumsum()).cumsum()
df7

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [39]:
df8=pd.DataFrame(np.random.RandomState(31).randint(1,101,(8,8)))
df8.unstack().sort_values()[-3:].index.tolist()

[(3, 0), (0, 3), (7, 2)]

In [40]:
df9=pd.DataFrame({
    "vals":np.random.RandomState(31).randint(-30,30,15),
    "grps":np.random.RandomState(31).choice(['A','B'],15)
})
def replace(group):
    mask=group<0
    group[mask]=group[~mask].mean()
    return group
df9.groupby(["grps"])["vals"].transform(replace)

0     13.6
1     28.0
2     13.6
3      4.0
4     13.6
5     28.0
6     13.6
7     13.6
8      8.0
9     28.0
10    28.0
11    12.0
12    16.0
13    13.6
14    13.6
Name: vals, dtype: float64

In [41]:
# gfg problem
n=int(input())
ls=[]
i=0
while(i<n):
 str=input()
 st=str.split() 
 if st[0]=="insert":
   ls.append(int(st[2]))
   i+=1
 elif st[0]=="append":
   ls.append(int(st[1]))
   i+=1
 elif st[0]=="remove":
   ls.remove(int(st[1]))
   i+=1 
 elif st[0]=="print":
   print(ls)
   i+=1
 elif st[0]=="sort":
   ls.sort()
   i+=1
 elif st[0]=="reverse":
   ls.reverse()
   i+=1
 elif st[0]=="pop":
   ls.pop()
   i+=1

KeyboardInterrupt: Interrupted by user

In [ ]:
df9=pd.DataFrame({"group": list("aabbabbbabab"),
                 "value": [1,2,3,np.nan,2,3,np.nan,1,7,3,np.nan,8]
                 })
g1=df9.groupby("group")["value"]
g2=df9.fillna(0).groupby("group")["value"]
s=g2.rolling(3,min_periods=1).sum()/g1.rolling(3,min_periods=1).count()

s.reset_index(level=0,drop=True).sort_index()

In [ ]:
# series and DatetimeIndex

In [ ]:
dti=pd.date_range(start="2015-01-01",end="2015-12-31",freq='B')
st=pd.Series(np.random.rand(len(dti)),index=dti)
st

In [ ]:
d=pd.date_range(start='2018-01-01',end="2018-01-05",freq='6H') # yy-mm-dd
d

In [ ]:
st[st.index.weekday==2].sum()

In [ ]:
st.resample('M').mean() # resample primarliy used in time series arguments M ,W , SM ,Q

In [ ]:
st.groupby(pd.Grouper(freq="4M")).idxmax() # return all column max element index i.e axis 0  (default)

In [ ]:
pd.date_range("2015-01-01","2016-12-03",freq="WOM-3THU")

In [ ]:
# Cleaning Data
df10=pd.DataFrame({"From_To":["LoNDon_paris","MAdri_miLAN","londON_StockhOlm","Budapest_PaRis","Brussels_lonDon"],
      "FlightNumber":[10045,np.nan,10065,np.nan,10085],
      "RecentDelays":["KLM(!)","<Air France (12)","(British Airways. )","12. Air France",'"Swiss Air"']
                  })
df10["FlightNumber"]=df10["FlightNumber"].interpolate().astype("int") # interpolate() is used to fill nan value
df10

In [ ]:
temp=df10.From_To.str.split('_',expand=True)
temp.columns=["From","To"]
temp

In [ ]:
temp["From"]=temp["From"].str.capitalize()
temp["To"]=temp["To"].str.capitalize()
temp

In [1]:
df10=df10.drop("From_To",axis="columns")
df10=df10.join(temp)
df10

NameError: name 'df10' is not defined

In [ ]:
df10["RecentDelays"]=df10["RecentDelays"].str.extract("([a-zA-Z\s]+)",expand=False).str.strip()
# str.extract()
#return a DataFrame with one column if expand=True
#return a Series if expand=False
df10

In [ ]:
dly=df10["RecentDelays"].apply(pd.Series)
dly.columns=["delay_{}".format(n) for n in range(1,len(dly.columns)+1)]
df10=df10.drop("RecentDelays",axis=1).join(dly)
df10

In [ ]:
# using MultiIndexes
letters=['A','B','C']
numbers=list(range(10))
mi=pd.MultiIndex.from_product([letters,numbers])
s=pd.Series(np.random.rand(30),index=mi)
s

In [ ]:
s.index.is_lexsorted()
# or more verbosely...
s.index.lexsort_depth==s.index.nlevels

In [ ]:
s.loc[:,[1,3,6]]


#s.loc[['A']][:3]

In [ ]:
s.loc[pd.IndexSlice[:'B',5:]]
# equivalent
s.loc[slice(None,'B'),slice(5,None)]

In [ ]:
#s.sum(level=0)
#or
#s.unstack(level=0).sum() # sum row level=0
# or
s.unstack().sum(axis="columns")

In [ ]:
new_s=s.swaplevel(0,1)
if not new_s.index.is_lexsorted():
   new_s=new_s.sort_index()

#new_s
new_s.sort_index()

In [43]:
x=5
y=4
p=pd.core.reshape.util.cartesian_product([np.arange(x),np.arange(y)])
df11=pd.DataFrame(np.asarray(p).T,columns=['x','y'])
df11

/tmp/ipykernel_3585/1533329606.py:3: DeprecationWarning: `cumproduct` is deprecated as of NumPy 1.25.0, and will be removed in NumPy 2.0. Please use `cumprod` instead.
  p=pd.core.reshape.util.cartesian_product([np.arange(x),np.arange(y)])

    x  y
0   0  0
1   0  1
2   0  2
3   0  3
4   1  0
5   1  1
6   1  2
7   1  3
8   2  0
9   2  1
10  2  2
11  2  3
12  3  0
13  3  1
14  3  2
15  3  3
16  4  0
17  4  1
18  4  2
19  4  3

In [44]:
df11['mine']=np.random.binomial(1,0.4,x*y)
df11

    x  y  mine
0   0  0     1
1   0  1     0
2   0  2     0
3   0  3     0
4   1  0     0
5   1  1     0
6   1  2     1
7   1  3     1
8   2  0     1
9   2  1     1
10  2  2     1
11  2  3     0
12  3  0     0
13  3  1     1
14  3  2     0
15  3  3     0
16  4  0     1
17  4  1     0
18  4  2     1
19  4  3     1

In [51]:
df11["adjacent"]=\
     df11.merge(df11+[1,1,0],on=['x','y'],how='left')\
         .merge(df11+[1,-1,0],on=['x','y'],how='left')\
         .merge(df11+[-1,1,0],on=['x','y'],how='left')\
         .merge(df11+[-1,-1,0],on=['x','y'],how='left')\
         .merge(df11+[1,0,0],on=['x','y'],how='left')\
         .merge(df11+[-1,0,0],on=['x','y'],how='left')\
         .merge(df11+[0,1,0],on=['x','y'],how='left')\
         .merge(df11+[1,-1,0],on=['x','y'],how='left')\
           .iloc[:,3:]\
            .sum(axis=1)

df11

ValueError: Unable to coerce to Series, length must be 4: given 3

In [49]:
df11.loc[df11["mine"]==1,"adjacent"]==np.nan

0     False
6     False
7     False
8     False
9     False
10    False
13    False
16    False
18    False
19    False
Name: adjacent, dtype: bool